app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Momma"], ["updated_at", "2021-02-18 17:15:51.650201"], ["id", 5]]